## Pandas 1 - Exercício 4

In [1]:
import pandas as pd

##### Carregue, em um objeto DataFrame, o arquivo CSV que você salvou no item (f) da questão anterior. Em seguida,

In [14]:
df = pd.read_csv('./arquivos_gerados/imc.csv', sep=',')
df

   Peso (kg)  Altura (cm)        IMC
0         72          180  22.222222
1         80          170  27.681661
2         60          175  19.591837
3         90          174  29.726516
4        100          185  29.218408

##### (a) Crie uma nova coluna que contenha o nome das pessoas (sinta-se à vontade para atribuir os nomes que preferir).

In [22]:
df['Nome'] = ['Ted', 'Lily', 'Barney', 'Robin', 'Marshall']
df = df[['Nome', 'Peso (kg)', 'Altura (cm)', 'IMC']]
df

       Nome  Peso (kg)  Altura (cm)        IMC
0       Ted         72          180  22.222222
1      Lily         80          170  27.681661
2    Barney         60          175  19.591837
3     Robin         90          174  29.726516
4  Marshall        100          185  29.218408

###### (b) Defina a nova coluna criada (com os nomes) como o índice (`index`) do seu DataFrame.

In [27]:
df.set_index('Nome')

          Peso (kg)  Altura (cm)        IMC
Nome
Ted              72          180  22.222222
Lily             80          170  27.681661
Barney           60          175  19.591837
Robin            90          174  29.726516
Marshall        100          185  29.218408

###### (c) Obtenha o nome das pessoas que são classificadas com Sobrepeso (IMC entre 25 e 29,9).

In [38]:
sobrepeso = (df['IMC'].between(24.9, 29.9))
df[sobrepeso]['Nome'].tolist()

['Lily', 'Robin', 'Marshall']